---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LayerElemBaseExtensionDis
source: html/40f74ef1-ad06-052f-08c5-2d51828adff2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LayerElemBaseExtensionDis Property

"Base Extension Distance"

## Syntax (C#)
```csharp
public static ForgeTypeId LayerElemBaseExtensionDis { get; }
```